# Dockerfile

# Шаг 1: Указываем базовый образ. Мы берем официальный образ Python версии 3.10
# 'slim' означает, что это легковесная версия, без лишних инструментов.
FROM python:3.12-slim

# Шаг 2: Устанавливаем рабочую директорию внутри контейнера.
# Все последующие команды будут выполняться в этой папке.
WORKDIR /app

# Шаг 3: Копируем файл с зависимостями в контейнер.
# Мы копируем сначала только его, т.к. Docker кэширует слои.
# Если зависимости не менялись, Docker не будет переустанавливать их при каждой сборке.
COPY requirements.txt .

# Шаг 4: Устанавливаем зависимости с помощью pip.
# --no-cache-dir говорит pip не сохранять кэш, чтобы итоговый образ был меньше.
RUN pip install --no-cache-dir -r requirements.txt

# Шаг 5: Копируем все остальные файлы проекта (наш bot.py) в контейнер.
COPY . .

# Шаг 6: Указываем команду, которая будет запущена при старте контейнера.
# Это эквивалентно запуску 'python bot.py' в терминале.
CMD ["python", "main.py"]