


start_text = """

<b>Доброго времени суток!</b>
<i>Я к вашим услугам — выберите, в каком режиме поработаем сегодня:</i>

🎲 <b>Рандомный факт</b> — один клик, и в копилке новая любопытная вещь.  
🤖 <b>ChatGPT-интерфейс</b> — свободное общение, идеи, задачи.  
🗣️ <b>Диалог с личностью</b> — разговор «как если бы…».  
❓ <b>Квиз</b> — короткие вопросы, честные ответы.  
🌐 <b>Переводчик</b> — смысл, стиль и тон без потерь.  
🎬 <b>Рекомендации</b> — под настроение подберу кино и книги.

"""

setting_text = """


🛠️ Пока не доступно. эта опция в разработке 🛠️

"""